import Cover from "@/components/theme/header/cover/cover";
import {HeaderTitle} from "@/components/theme/page/components/headerTitle";

export default function TextPage({ params }: { params: { page: string } }) {
    return (<>
            <Cover/>
            <div className="container py-4">
                <HeaderTitle title={'ტექსტ გვერდი'} slug={[]}/>

                <div className='text_font'>
                    <p>აქ შეგიძლია გამოყვანო ინფორმაცია `{params.page}`-ის მიხედვით.</p>
                    <p>
                        ჩვენი პრინტ მომსახურება იწყება პროფესიონალური დიზაინის შექმნით, რომელიც მაქსიმალურად პასუხობს თქვენს საჭიროებებსა და მოლოდინებს. ჩვენი გამოცდილ დიზაინერების გუნდი მუშაობს თქვენთან ერთად, რათა განვსაზღვროთ თქვენი პროექტის უნიკალური სტილი და ვიზუალური იდენტობა.
                        დიზაინის პროცესში:

                        ვიღებთ თქვენს იდეებს და კონცეფციებს, რათა უზრუნველვყოთ, რომ საბოლოო პროდუქტი იდეალურად შეესაბამება თქვენს მოთხოვნებს.

                        ვაწვდით რამდენიმე ესკიზსა და ვარიანტს, რათა შეძლოთ საუკეთესო დიზაინის არჩევა.

                        ვცდილობთ მაქსიმალურად გავითვალისწინოთ ფერების, ტექსტურებისა და კომპოზიციის ყველა დეტალი, რათა თქვენი იდეა სრულყოფილად განხორციელდეს.

                        ვთავაზობთ დამატებით კორექტირებებს და გაუმჯობესებებს, სანამ არ იქნებით სრულიად კმაყოფილი.
                        თუ უკვე გაქვთ მზა დიზაინი, ჩვენ შეგვიძლია მისი ტექნიკური ოპტიმიზაცია ბეჭდვისთვის, რათა თავიდან ავიცილოთ ხარისხის ნებისმიერი შემცირება.
                    </p>
                </div>

            </div>
        </>
    );
}
